{
  "directions": {
    "direction1": {
      "name": "IT Школа Samsung",
      "description": "IT ШКОЛА SAMSUNG была запущена в 2014 году. Курс, разработанный Российским Исследовательским центром Samsung, поможет учащимся освоить фундаментальные разделы ИТ и программирования в адаптированной для школьников форме, получить практические навыки по разработке мобильных приложений в идеологии промышленной индустрии «от идеи до дистрибуции».В рамках направления Вы:-изучите основы программирования на языке Java;-познакомитесь с объектно-ориентированным программированием;-узнаете основы программирования Android приложений;-научитесь применять алгоритмы и структуры данных на языке Java;-опробуете основы разработки серверной части мобильных приложений.Рекомендовано для 9-10 класса.",
      "teacher":"Sbdy",
      "tags":["Java","Android","ООП"]
    },
    "direction2":{
      "name":"Разработка VR/AR приложений",
      "description" : "За последние десятилетие виртуальная и дополненная реальность из недосягаемого, фантастики, переросла в довольно повседневную технологию, которая не перестает удивлять.На занятиях по направлению Вы:- научитесь разбираться в технологиях и адаптировать их под свои проекты;-будете применять самостоятельные разработки приложений виртуальной (VR), дополненной (AR) и смешанной (MR) реальности для различных устройств;-разберете приемы программирования в контексте игрового движка Unity.-освоите ААА-пайплайн в 3D- моделировании (разработка lowpoly-модели с разверткой и простой текстурой).Рекомендовано для 12-18 лет.",
      "teacher":"Sbdy",
      "tags":["VR","AR","Unity"]
    },
    "direction3":{
      "name":"Программирование на Java",
      "description" : "Java – язык программирования. Согласно рейтингу, в котором языки программирования расположены по количеству поисковых запросов на порталах Wikipedia, Google, YouTube и других, Java занимает первое место. Java используется при создании приложений для мобильных устройств, удаленных процессоров, беспроводных модулей, датчиков, да и в целом — программировании практически любых электроустройств. Язык востребован благодаря огромному выбору библиотек под любые задачи. Ну а многомиллионное сообщество постоянно наращивает их количество. Таким образом, Java постоянно развивается и создателями языка, и его пользователями.На занятиях этого направления Вы:- познакомитесь с синтаксисом языка;- рассмотрите элементы объектно-ориентированного программирования;-поработаете с данными и алгоритмами;- изучите графику и интерфейсы;-освоите один из самых популярных языков.Рекомендовано для 12-18 лет.",
      "teacher":"sbdy",
      "tags":["Java","ООП"]
    },
    "direction4":{
      "name":"Кибергигиена и большие данные",
      "description" : "Что же такое «кибегигиена»?Кибергигиена - это правила соблюдения простых правил цифровой безопасности при работе с интернетом, ставшим полноценной частью нашей жизни. Звучит достаточно просто, но за время пандемии рост кибератак и преступлений в сфере электронных коммуникаций увеличился в разы. Так что же ждет Вас в ходе обучения?В рамках направления Вы:- научитесь искать достоверную информацию в интернете;- анализировать большие данные;- безопасно и рационально использовать личные и персональные данные;- распознавать угрозы в интернет-ресурсах и противодействовать им.Рекомендовано для 12-18 лет.",
      "teacher":"sbdy",
      "tags":["Безопасность","BigData"]
    },
    "direction5":{
      "name":"Программирование на Python",
      "description" : "Python - это высокоуровневый язык программирования общего назначения. Его синтаксис минималистичен, а возможности безграничны.Самарский областной Центр детско-юношеского технического творчества является площадкой-партнером федеральной образовательной программы «Яндекс.Лицей». «Яндекс.Лицей» — это проект компании «Яндекс» по обучению школьников цифровым технологиям. Учебная программа рассчитана на два года. На занятиях ребята знакомятся с теорией программирования и осваивают технологии на практике.В рамках данного направления учащиеся:-познакомятся с языком, изучат основные понятия и конструкции: переменные, условия, циклы, операторы, списки, функции;-изучат словари, поработают со стандартной библиотекой и с внешними библиотеками, начнут узнавать основы объектно-ориентированного программирования;-начнут узнавать технологии разработки программ и графические интерфейсы;-научатся решать прикладные задачи и создадут приложения с графическим интерфейсом и разными библиотеками;Рекомендовано для 8-9 класса.",
      "teacher":"sbdy",
      "tags":["Python"]
    },
    "direction6":{
      "name":"Системное администрирование",
      "description" : "Системное администрирование представляет собой процесс управления, технического обслуживания и проведение других технических мероприятий, направленных на поддержание информационной компьютерной системы.В ходе обучения Вы узнаете:- как устроен компьютер;- изучите его программное наполнение;- ознакомитесь с принципами работы систем администрирования и управления в информационных системах;- поймёте, как работает программное обеспечение, настройка оборудования, сетевые технологии, а также научитесь управлять операционной системой Linux;Рекомендовано для 12-18 лет.",
      "teacher":"sbdy",
      "tags":["Админ"]
    }
  }
}